In [1]:
import pandas as pd
import numpy as np

# olmayan veriler

In [4]:
sozlukVerisi = {"İstanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "İzmir" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [5]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [8]:
havaDurumuDataFrame.dropna() #NaN olan satırları göstermez  (default axis=0)

   İstanbul  Ankara  İzmir
0      30.0    20.0     40

In [10]:
havaDurumuDataFrame.dropna(axis = 1)  #axis 1 yani boş olmayan kolon full

   İzmir
0     40
1     39
2     38

In [11]:
havaDurumuDataFrame.dropna(axis = 0)

   İstanbul  Ankara  İzmir
0      30.0    20.0     40

# örnek 2

In [12]:
yeniVeri = {"İstanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "İzmir" : [40,39,38], "Antalya" : [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [13]:
yeniDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [14]:
yeniDataFrame.dropna(axis = 1, thresh = 2)  #thresh NaN sayısına kadar demek

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [16]:
yeniDataFrame.dropna(axis = 0)

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0

# groupby

In [20]:
maasSozlugu = {
    "Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
    "Çalışan İsmi" : ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
    "Maaş" : [100,150,200,300,400,500]
}

In [21]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [22]:
maasDataFrame

   Departman Çalışan İsmi  Maaş
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [24]:
grup_objesi = maasDataFrame.groupby("Departman")

In [25]:
grup_objesi.count()

           Çalışan İsmi  Maaş
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [26]:
grup_objesi.mean()

            Maaş
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [27]:
grup_objesi.max()

          Çalışan İsmi  Maaş
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [28]:
grup_objesi.min()

          Çalışan İsmi  Maaş
Departman
Hukuk            Fatma   400
Pazarlama         Atil   200
Yazılım          Ahmet   100

In [29]:
grup_objesi.describe()

           Maaş
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0